//1.Написать программу, которая через prompt считывает число и выводит в консоль число равное 10% от введенного числа

// let Number = prompt("Введите число:");
// let number = Number * 0.1;
// console.log("10% от введенного числа равно: " + number);

//2.Написать программу, которая получает два числа и выводит наименьшее


//  let firstNumber = prompt("Введите первое число:");
//  let secondNumber = prompt("Введите второе число:");20
//        if (firstNumber < secondNumber) {
//      console.log("Наименьшее число:" + firstNumber);
//      } else {
//          console.log("Наименьшее число:" + secondNumber);
//      }



//3.Написать программу, которая считывает через prompt число и выводит одно из следующих сообщений: ‘Число меньше 100’, ‘Число больше 100’ или ‘Число равно 100’

// let number = prompt("Введите число:");
//     if (number < 100) {
//         console.log("Число меньше 100");
//     } else if (number > 100) {
//         console.log("Число больше 100");
//     } else {
//         console.log("Число равно 100");
//     }

//4.Написать программу, которая запрашивает у пользователя его имя и возраст (в годах) и выводит в консоль сообщение ‘Hello, <name>’, если пользователь совершеннолетний, или ‘Hi, <name>’, если пользователь несовершеннолетний.

// let name = prompt("Введите ваше имя:");
// let age = prompt("Введите ваш возраст (в годах):");
// if (age >= 18) {
//     console.log("Hello, " + name); 
// } else {
//     console.log("Hi, " + name); 
// }